//================================= Задача 4 ====================================
// Задача 4.Вивести список як маркований список з елементами у форматі (name: salary)

 //========================================================================================================================================================
  

const { createApp } = Vue



const task4 = createApp({
  data() {
    return {
      workers: [
        { name: "John", id: 1, salary: 20000 },
        { name: "Peter", id: 2, salary: 18000 },
        { name: "Olga Ivanivna", id: 3, salary: 16000 },
        { name: "Tany", id: 4, salary: 50000 },
        { name: "Stepan", id: 5, salary: 28000 },
        { name: "Баба Галя", id: 6, salary: 100000 },
      ],
    }
  },
  computed: {
  },
  methods: {
   
  },
})
task4.mount("#app4")
//========================================================================================================================================================
